<?php
!defined('IN_LOT')&&die('Access Denied');
/* 广东快乐10分投注信息 */
$return = array();
$return[1] = array(
    '第一球',
    array(
        1 => '1',
        2 => '2',
        3 => '3',
        4 => '4',
        5 => '5',
        6 => '6',
        7 => '7',
        8 => '8',
        9 => '9',
        10 => '10',
        11 => '11',
        12 => '12',
        13 => '13',
        14 => '14',
        15 => '15',
        16 => '16',
        17 => '17',
        18 => '18',
        19 => '19',
        20 => '20',
        21 => '大',
        22 => '小',
        23 => '单',
        24 => '双',
        25 => '尾大',
        26 => '尾小',
        27 => '合单',
        28 => '合双',
        29 => '东',
        30 => '南',
        31 => '西',
        32 => '北',
        33 => '中',
        34 => '发',
        35 => '白',
    ),
);
$return[2] = $return[3] = $return[4] = $return[5] = $return[1];
$return[6] = $return[7] = $return[8] = $return[1];
$return[2][0] = '第二球';
$return[3][0] = '第三球';
$return[4][0] = '第四球';
$return[5][0] = '第五球';
$return[6][0] = '第六球';
$return[7][0] = '第七球';
$return[8][0] = '第八球';
$return[9] = array(
    '总和 龙虎',
    array(
        1 => '总和大',
        2 => '总和小',
        3 => '总和单',
        4 => '总和双',
        5 => '总和尾大',
        6 => '总和尾小',
        7 => '龙',
        8 => '虎',
    ),
);
return $return;