<?php
!defined('IN_LOT')&&die('Access Denied');
include(IN_LOT.'include/class/lunar.class.php');

/* 期数信息 */
$LOT['six'] = [
    'qishu' => date('Ymd', $LOT['bjtime']),
    'opentime' => fmod($LOT['bjtime']-14400, 86400),
];
$LOT['six']['qishu'].= substr('000'.(floor($LOT['six']['opentime']/90)+1), -3);
$LOT['six']['opentime'] = 90-fmod($LOT['six']['opentime'], 90);

/* 波色信息 */
$LOT['color'] = array(
    1 => 'red',
    2 => 'red',
    3 => 'blue',
    4 => 'blue',
    5 => 'green',
    6 => 'green',
    7 => 'red',
    8 => 'red',
    9 => 'blue',
    10 => 'blue',
    11 => 'green',
    12 => 'red',
    13 => 'red',
    14 => 'blue',
    15 => 'blue',
    16 => 'green',
    17 => 'green',
    18 => 'red',
    19 => 'red',
    20 => 'blue',
    21 => 'green',
    22 => 'green',
    23 => 'red',
    24 => 'red',
    25 => 'blue',
    26 => 'blue',
    27 => 'green',
    28 => 'green',
    29 => 'red',
    30 => 'red',
    31 => 'blue',
    32 => 'green',
    33 => 'green',
    34 => 'red',
    35 => 'red',
    36 => 'blue',
    37 => 'blue',
    38 => 'green',
    39 => 'green',
    40 => 'red',
    41 => 'blue',
    42 => 'blue',
    43 => 'green',
    44 => 'green',
    45 => 'red',
    46 => 'red',
    47 => 'blue',
    48 => 'blue',
    49 => 'green',
);
/* 生肖年信息 */
$LOT['_temp'] = array();
$LOT['_temp'][0] = array(
    '鼠',
    '牛',
    '虎',
    '兔',
    '龙',
    '蛇',
    '马',
    '羊',
    '猴',
    '鸡',
    '狗',
    '猪',
);
$LOT['_temp'][1] = array(
    array(1, 13, 25, 37, 49),
    array(2, 14, 26, 38),
    array(3, 15, 27, 39),
    array(4, 16, 28, 40),
    array(5, 17, 29, 41),
    array(6, 18, 30, 42),
    array(7, 19, 31, 43),
    array(8, 20, 32, 44),
    array(9, 21, 33, 45),
    array(10, 22, 34, 46),
    array(11, 23, 35, 47),
    array(12, 24, 36, 48),
);
$LOT['animal'] = array();
$LOT['lunar'] = '未知';
/* 加载农历年份 */
$_lunar = new Lunar();
$_ldate = $_lunar->convertSolarToLunar(date('Y', $LOT['bjtime']), date('m', $LOT['bjtime']), date('d', $LOT['bjtime']));
unset($_lunar);
foreach($LOT['_temp'][0] as $key=>$val){
    $key = fmod($_ldate[0]-$key+8, 12);
    $LOT['animal'][$val] = $LOT['_temp'][1][$key];
    $key==0&&$LOT['lunar'] = $val;
}
unset($LOT['_temp']); // 释放临时信息

/* 特码 */
$return = array();
$return[1] = array(
    array('特码'),
    array(
        1 => '1',
        2 => '2',
        3 => '3',
        4 => '4',
        5 => '5',
        6 => '6',
        7 => '7',
        8 => '8',
        9 => '9',
        10 => '10',
        11 => '11',
        12 => '12',
        13 => '13',
        14 => '14',
        15 => '15',
        16 => '16',
        17 => '17',
        18 => '18',
        19 => '19',
        20 => '20',
        21 => '21',
        22 => '22',
        23 => '23',
        24 => '24',
        25 => '25',
        26 => '26',
        27 => '27',
        28 => '28',
        29 => '29',
        30 => '30',
        31 => '31',
        32 => '32',
        33 => '33',
        34 => '34',
        35 => '35',
        36 => '36',
        37 => '37',
        38 => '38',
        39 => '39',
        40 => '40',
        41 => '41',
        42 => '42',
        43 => '43',
        44 => '44',
        45 => '45',
        46 => '46',
        47 => '47',
        48 => '48',
        49 => '49',
        50 => '单',
        51 => '双',
        52 => '大',
        53 => '小',
        54 => '合单',
        55 => '合双',
        56 => '红波',
        57 => '绿波',
        58 => '蓝波',
        59 => '家禽',
        60 => '野兽',
        61 => '尾大',
        62 => '尾小',
        63 => '大单',
        64 => '小单',
        65 => '大双',
        66 => '小双',
    ),
);

/* 正码 */
$return[2] = array(
    array('正码'),
    array(
        1 => '1',
        2 => '2',
        3 => '3',
        4 => '4',
        5 => '5',
        6 => '6',
        7 => '7',
        8 => '8',
        9 => '9',
        10 => '10',
        11 => '11',
        12 => '12',
        13 => '13',
        14 => '14',
        15 => '15',
        16 => '16',
        17 => '17',
        18 => '18',
        19 => '19',
        20 => '20',
        21 => '21',
        22 => '22',
        23 => '23',
        24 => '24',
        25 => '25',
        26 => '26',
        27 => '27',
        28 => '28',
        29 => '29',
        30 => '30',
        31 => '31',
        32 => '32',
        33 => '33',
        34 => '34',
        35 => '35',
        36 => '36',
        37 => '37',
        38 => '38',
        39 => '39',
        40 => '40',
        41 => '41',
        42 => '42',
        43 => '43',
        44 => '44',
        45 => '45',
        46 => '46',
        47 => '47',
        48 => '48',
        49 => '49',
        50 => '总单',
        51 => '总双',
        52 => '总大',
        53 => '总小',
    ),
);

/* 正特1-6 */
$return[3] = array(
    array('正1特'),
    array(
        1 => '1',
        2 => '2',
        3 => '3',
        4 => '4',
        5 => '5',
        6 => '6',
        7 => '7',
        8 => '8',
        9 => '9',
        10 => '10',
        11 => '11',
        12 => '12',
        13 => '13',
        14 => '14',
        15 => '15',
        16 => '16',
        17 => '17',
        18 => '18',
        19 => '19',
        20 => '20',
        21 => '21',
        22 => '22',
        23 => '23',
        24 => '24',
        25 => '25',
        26 => '26',
        27 => '27',
        28 => '28',
        29 => '29',
        30 => '30',
        31 => '31',
        32 => '32',
        33 => '33',
        34 => '34',
        35 => '35',
        36 => '36',
        37 => '37',
        38 => '38',
        39 => '39',
        40 => '40',
        41 => '41',
        42 => '42',
        43 => '43',
        44 => '44',
        45 => '45',
        46 => '46',
        47 => '47',
        48 => '48',
        49 => '49',
        50 => '单',
        51 => '双',
        52 => '大',
        53 => '小',
        54 => '合单',
        55 => '合双',
        56 => '红波',
        57 => '绿波',
        58 => '蓝波',
        59 => '合大',
        60 => '合小',
    ),
);
$return[8] = $return[7] = $return[6] = $return[5] = $return[4] = $return[3];
$return[4][0][0] = '正2特';
$return[5][0][0] = '正3特';
$return[6][0][0] = '正4特';
$return[7][0][0] = '正5特';
$return[8][0][0] = '正6特';

/* 正码1-6 */
$return[9] = array(
    array('正码1', 2 => 9, 3 => 14), //指定类型id的范围
    array(
        1 => '大',
        2 => '小',
        3 => '单',
        4 => '双',
        5 => '红波',
        6 => '绿波',
        7 => '蓝波',
        8 => '合大',
        9 => '合小',
        10 => '合单',
        11 => '合双',
        12 => '尾大',
        13 => '尾小',
    ),
);
$return[14] = $return[13] = $return[12] = $return[11] = $return[10] = $return[9];
$return[10][0][0] = '正码2';
$return[11][0][0] = '正码3';
$return[12][0][0] = '正码4';
$return[13][0][0] = '正码5';
$return[14][0][0] = '正码6';

/* 过关 */
$return[15] = array(
    array('过关', '正码1', 15, 20), //指定类型id的范围以及下注类型
    array(
        1 => '单',
        2 => '双',
        3 => '大',
        4 => '小',
        5 => '红波',
        6 => '绿波',
        7 => '蓝波',
    ),
);
$return[20] = $return[19] = $return[18] = $return[17] = $return[16] = $return[15];
$return[16][0][1] = '正码2';
$return[17][0][1] = '正码3';
$return[18][0][1] = '正码4';
$return[19][0][1] = '正码5';
$return[20][0][1] = '正码6';

/* 半波 */
$return[21] = array(
    array('半波'),
    array(
        1 => '红单',
        2 => '红双',
        3 => '红大',
        4 => '红小',
        5 => '绿单',
        6 => '绿双',
        7 => '绿大',
        8 => '绿小',
        9 => '蓝单',
        10 => '蓝双',
        11 => '蓝大',
        12 => '蓝小',
        13 => '红合单',
        14 => '红合双',
        15 => '绿合单',
        16 => '绿合双',
        17 => '蓝合单',
        18 => '蓝合双',
    ),
);

/* 一肖 */
$return[22] = array(
    array('一肖'),
    array(
        1 => '鼠',
        2 => '牛',
        3 => '虎',
        4 => '兔',
        5 => '龙',
        6 => '蛇',
        7 => '马',
        8 => '羊',
        9 => '猴',
        10 => '鸡',
        11 => '狗',
        12 => '猪',
    ),
);

/* 尾数 */
$return[23] = array(
    array('尾数'),
    array(
        1 => '0',
        2 => '1',
        3 => '2',
        4 => '3',
        5 => '4',
        6 => '5',
        7 => '6',
        8 => '7',
        9 => '8',
        10 => '9',
    ),
);

/* 特肖 */
$return[24] = $return[22];
$return[24][0][0] = '特肖';

/* 生肖连 */
$return[25] = $return[22];
$return[25][0] = array('二肖连中', 4 => 2);
$return[31] = $return[30] = $return[29] = $return[28] = $return[27] = $return[26] = $return[25];
$return[26][0][0] = '三肖连中';
$return[26][0][4] = 3;
$return[27][0][0] = '四肖连中';
$return[27][0][4] = 4;
$return[28][0][0] = '五肖连中';
$return[28][0][4] = 5;
$return[29][0][0] = '二肖连不中';
$return[30][0][0] = '三肖连不中';
$return[30][0][4] = 3;
$return[31][0][0] = '四肖连不中';
$return[31][0][4] = 4;

/* 尾数连 */
$return[32] = $return[23];
$return[32][0] = array('二尾连中', 4 => 2);
$return[37] = $return[36] = $return[35] = $return[34] = $return[33] = $return[32];
$return[33][0][0] = '三尾连中';
$return[33][0][4] = 3;
$return[34][0][0] = '四尾连中';
$return[34][0][4] = 4;
$return[35][0][0] = '二尾连不中';
$return[36][0][0] = '三尾连不中';
$return[36][0][4] = 3;
$return[37][0][0] = '四尾连不中';
$return[37][0][4] = 4;

/* 合肖 */
$return[38] = $return[22];
$return[38][0] = array('二肖', 4 => 2);
$return[47] = $return[46] = $return[45] = $return[44] = $return[43] = $return[42] = $return[41] = $return[40] = $return[39] = $return[38];
$return[39][0][0] = '三肖';
$return[39][0][4] = 3;
$return[40][0][0] = '四肖';
$return[40][0][4] = 4;
$return[41][0][0] = '五肖';
$return[41][0][4] = 5;
$return[42][0][0] = '六肖';
$return[42][0][4] = 6;
$return[43][0][0] = '七肖';
$return[43][0][4] = 7;
$return[44][0][0] = '八肖';
$return[44][0][4] = 8;
$return[45][0][0] = '九肖';
$return[45][0][4] = 9;
$return[46][0][0] = '十肖';
$return[46][0][4] = 10;
$return[47][0][0] = '十一肖';
$return[47][0][4] = 11;

/* 全不中 */
$return[48] = array(
    array('五不中', 4 => 5),
    array(
        1 => '1',
        2 => '2',
        3 => '3',
        4 => '4',
        5 => '5',
        6 => '6',
        7 => '7',
        8 => '8',
        9 => '9',
        10 => '10',
        11 => '11',
        12 => '12',
        13 => '13',
        14 => '14',
        15 => '15',
        16 => '16',
        17 => '17',
        18 => '18',
        19 => '19',
        20 => '20',
        21 => '21',
        22 => '22',
        23 => '23',
        24 => '24',
        25 => '25',
        26 => '26',
        27 => '27',
        28 => '28',
        29 => '29',
        30 => '30',
        31 => '31',
        32 => '32',
        33 => '33',
        34 => '34',
        35 => '35',
        36 => '36',
        37 => '37',
        38 => '38',
        39 => '39',
        40 => '40',
        41 => '41',
        42 => '42',
        43 => '43',
        44 => '44',
        45 => '45',
        46 => '46',
        47 => '47',
        48 => '48',
        49 => '49',
    ),
);
$return[55] = $return[54] = $return[53] = $return[52] = $return[51] = $return[50] = $return[49] = $return[48];
$return[49][0][0] = '六不中';
$return[49][0][4] = 6;
$return[50][0][0] = '七不中';
$return[50][0][4] = 7;
$return[51][0][0] = '八不中';
$return[51][0][4] = 8;
$return[52][0][0] = '九不中';
$return[52][0][4] = 9;
$return[53][0][0] = '十不中';
$return[53][0][4] = 10;
$return[54][0][0] = '十一不中';
$return[54][0][4] = 11;
$return[55][0][0] = '十二不中';
$return[55][0][4] = 12;

/* 连码 */
$return[56] = $return[48];
$return[56][0] = array('三全中', '连码', 4 => 3);
$return[61] = $return[60] = $return[59] = $return[58] = $return[57] = $return[56];
$return[57][0][0] = '三中二';
$return[58][0][0] = '二全中';
$return[58][0][4] = 2;
$return[59][0][0] = '二中特';
$return[59][0][4] = 2;
$return[60][0][0] = '特串';
$return[60][0][4] = 2;
$return[61][0][0] = '四中一';
$return[61][0][4] = 4;
return $return;