<?php
!defined('IN_LOT')&&die('Access Denied');
/* 极速赛车投注信息 */
$return = array();
$return[1] = array(
    '冠、亚军和',
    array(
        1 => '3',
        2 => '4',
        3 => '5',
        4 => '6',
        5 => '7',
        6 => '8',
        7 => '9',
        8 => '10',
        9 => '11',
        10 => '12',
        11 => '13',
        12 => '14',
        13 => '15',
        14 => '16',
        15 => '17',
        16 => '18',
        17 => '19',
        18 => '冠亚大',
        19 => '冠亚小',
        20 => '冠亚单',
        21 => '冠亚双',
    ),
);
$return[2] = array(
    '冠军',
    array(
        1 => '1',
        2 => '2',
        3 => '3',
        4 => '4',
        5 => '5',
        6 => '6',
        7 => '7',
        8 => '8',
        9 => '9',
        10 => '10',
        11 => '大',
        12 => '小',
        13 => '单',
        14 => '双',
    ),
);
$return[11] = $return[10] = $return[9] = $return[8] = $return[7] = $return[6] = $return[5] = $return[4] = $return[3] = $return[2];
$return[3][0] = '亚军';
$return[4][0] = '第三名';
$return[5][0] = '第四名';
$return[6][0] = '第五名';
$return[7][0] = '第六名';
$return[8][0] = '第七名';
$return[9][0] = '第八名';
$return[10][0] = '第九名';
$return[11][0] = '第十名';
$return[12] = array('1V10 龙虎', array(1 => '龙', 2 => '虎'));
$return[13] = array('2V9 龙虎', array(1 => '龙', 2 => '虎'));
$return[14] = array('3V8 龙虎', array(1 => '龙', 2 => '虎'));
$return[15] = array('4V7 龙虎', array(1 => '龙', 2 => '虎'));
$return[16] = array('5V6 龙虎', array(1 => '龙', 2 => '虎'));
return $return;