<?php
!defined('IN_LOT')&&die('Access Denied');
/* k3投注信息 */
$return = array();
$return[1] = array(
    '和值',
    array(
        1 => '3',
        2 => '4',
        3 => '5',
        4 => '6',
        5 => '7',
        6 => '8',
        7 => '9',
        8 => '10',
        9 => '11',
        10 => '12',
        11=> '13',
        12 => '14',
        13=> '15',
        14=> '16',
        15=> '17',
        16=> '18',
        17=> '大',
        18=> '小',
        19=> '单',
        20=> '双',
        21=> '大单',
        22=> '大双',
        23=> '小单',
        24=> '小双',
    ),
);
$return[2] = array(
    '二不同号',
    array(
        1 => '二不同号',
    ),
);
$return[3] = array(
    '二同号',
    array(
        1=>'二同号复选',
        2=>'二同号单选'
    )
);
$return[4] = array(
    '三不同号',
    array(
        1 => '三不同号',
        2 => '三连号单选',
        3 => '三连号通选'
    )
);
$return[5] = array(
    '三同号',
    array(
        1=>'三同号通选',
        2=>'三同号单选'

    )
);

return $return;