<?php !defined('IN_LOT')&&die('Access Denied'); ?>
<div class="tab-colored-bd hide">
    <div class="typo">
        <h3>游戏简介</h3>
        <ul>
            <!--li>参考网址：<a href="http://www.1392c.com/shishicai/kaijiang/" target="_blank">http://www.1392c.com/shishicai/kaijiang/</a></li-->
            <li>pc蛋蛋开奖是按照北京快8的开奖结果计算得出。取其1-6位、7-12位、13-18位，三项皆取和值的末尾数，得到的三个数字即为开奖结果。此游戏的开奖时间完全与北京福彩网发行的北京快乐8同步</li>
        </ul>
        <h3>游戏玩法</h3>
        <h5>1、和值</h5>
        <ul>
            <li>和值：三个开奖号相加所得。</li>
        </ul>
        <h5>2、两面</h5>
        <ul>
            <li>大：三个球数值相加，和值大于等于14,15,16,17,18,19,20,21,22,23,24,25,26,27为大。</li>
            <li>小：三个球数值相加，和值小于等于00,01,02,03,04,05,06,07,08,09,10,11,12,13为小。</li>
            <li>单：三个球数值相加，和值为单数。</li>
            <li>双：三个球数值相加，和值为双数。</li>
            <li>大单（三个球数值相加，和值）：15,17,19,21,23,25,27为大单。</li>
            <li>小单（三个球数值相加，和值）：01,03,05,07,09,11,13为小单。</li>
            <li>大双（三个球数值相加，和值）：14,16,18,20,22,24,26为大双。</li>
            <li>小双（三个球数值相加，和值）：00,02,04,06,08,10,12为小双。</li>
        </ul>
        <h5>3、波色/豹子/包三</h5>
        <ul>
            <li>红波（三个球数值相加，和值）：<span style="color:red;">03,06,09,12,15,18,21,24</span>为红波。</li>
            <li>绿波（三个球数值相加，和值）：<span style="color:green;">01,04,07,10,16,19,22,25</span>为绿波。</li>
            <li>蓝波（三个球数值相加，和值）：<span style="color:blue;">02,05,08,11,17,20,23,26</span>为蓝波</li>
            <li>注： 当开奖结果为：0,13,14,27(所有买的波色皆输)视为全部不中奖！</li>
            <li>豹子：当期开出三个数字相同即为豹子。</li>
        </ul>
    </div>
</div>