<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>官方网站：<a href="http://www.luckyairship.com/" target="_blank">http://www.luckyairship.com/</a></li>
                        <!--li>参考网址：<a href="http://www.1392c.com/pk10/kaijiang/" target="_blank">http://www.1392c.com/pk10/kaijiang/</a></li-->
                        <li>该游戏的投注时间、开奖时间为一分钟一期，总共1440期。</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、第一名 ~ 第十名</h5>
                    <ul>
                        <li>第一名 ~ 第十名：船号指定，每一个船号为一投注组合，开奖结果“投注船号”对应所投名次视为中奖，其余情形视为不中奖。</li>
                        <li>两面：指单、双；大、小。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>单双：号码为双数叫双，如4、8；号码为单数叫单，如5、9。</li>
                                <li>大小：开出之号码大于或等于6为大，小于或等于5为小。</li>
                            </ul>
                        </li>
                    </ul>
                    <h5>2、龙虎斗</h5>
                    <ul>
                        <li>冠军 vs 第十 龙虎：“第一名”船号大于“第十名”船号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>亚军 vs 第九 龙虎：“第二名”船号大于“第九名”船号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>第三 vs 第八 龙虎：“第三名”船号大于“第八名”船号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>第四 vs 第七 龙虎：“第四名”船号大于“第七名”船号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>第五 vs 第六 龙虎：“第五名”船号大于“第六名”船号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                    </ul>
                    <h5>3、冠亚军和</h5>
                    <ul>
                        <li>冠军船号＋亚军船号＝冠亚和值：“冠亚和值”可能出现的结果为3 ~ 19， 投中对应“冠亚和值”数字的视为中奖，其余视为不中奖。</li>
                        <li>冠亚和单双：“冠亚和值”为单时投注“单”的注单视为中奖，为双时投注“双”的注单视为中奖，等于11为和局，其余视为不中奖。</li>
                        <li>冠亚和大小：“冠亚和值”大于11时投注“大”的注单视为中奖，小于11时投注“小”的注单视为中奖，等于11为和局，其余视为不中奖。</li>
                    </ul>
                </div>
            </div>
