<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>开奖时间：7*24小时（北京时间凌晨00:00为前一天最后一期开奖时间）</li>
                        <li>开奖频率：每三分钟/期,共480期</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、和值</h5>
                    <ul>
                        <li>和值：三颗骰子开出之点数总和值3-18，任选1点数进行投注，当开奖结果【第一颗、第二颗、第三颗】之点数总和值与所选定额点数相同时，视为中奖。
                            <p>三个开奖号的【第一颗、第二颗、第三颗】点数总和值与所选的点数"6"相同时，视为中奖，其它视为不中奖。</p></li>
                        <li>大、小、单、双：三个开奖号总和大于11为大，小于11为小，和为奇数为单，偶数为双</li>
                        <li>大单、小单、大双、小双：三个开奖号总和大于11且为奇数为大单,为偶数时为大双；三个开奖号和小于11且为奇数为小单，偶数为小双</li>
                    </ul>
                    <h5>2、三连号通选</h5>
                    <ul>
                        <li>是指对所有相同的三个号码（111、222、333、444、555、666）进行投注
                            <p>开奖号为111、222、333、444、555、666其中任意一种情况，视为中奖，其它视为不中奖。</p></li>

                    </ul>
                    <h5>3、三同号单选</h5>
                    <ul>
                        <li>是指从所有相同的三个号码（111、222、333、444、555、666）中任意选择一组号码进行投注 当开奖号。
                            <p>开奖号为111、222、333、444、555、666时，开奖号与所选的三同号相同时，视为中奖，其它视为不中奖。</p></li>
                    </ul>
                    <h5>4、三不同号</h5>
                    <ul>
                        <li>是指对三个各不相同的号码进行投注
                        <p>开奖号与所选的三不同号相同时，视为中奖，其它视为不中奖</p></li>
                    </ul>
                    <h5>5、三连号单选</h5>
                    <ul>
                        <li>是指对所有三个相连的号码（仅限：123、234、345、456）进行投注
                            <p>开奖号与所选的三连号相同时，视为中奖，其它视为不中奖。</p></li>
                    </ul>
                    <h5>6、三连号通选</h5>
                    <ul>
                        <li>
                            是指在所有三个相连的号码（123、234、345、456）进行投注。<p>
                                如开奖号为 123，234，345，456 其中任意一种情况，视为中奖，其他视为不中奖
                            </p>
                        </li>
                    </ul>
                    <h5>7、二同号复选</h5>
                    <ul>
                        <li>三个号码中两个指定的相同号码和一个任意号码进行投注
                            <p>开奖号为(11*,22*,33*,44*,55*,66*)时,开奖号中的任意两颗与所选的复选号相同，视为中奖，其他视为不中奖</p>
                        </li>
                    </ul>

                    <h5>8、二同号单选</h5>
                    <ul>
                        <li>
                            三个号码中两个指定的相同号码和一个指定的不同号码进行投注
                            <p>三个开奖号相同时视为中奖,其他视为不中奖</p>
                        </li>
                    </ul>
                    <h5>9、二不同号</h5>
                    <ul>
                        <li>
                            三个号码中两个指定的不同号码和一个任意号码进行投注
                            <p>开奖号中任意两个号与所选号相同，视为中奖，其他视为不中奖</p>
                        </li>
                    </ul>
                </div>
            </div>
