<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>官方网站：<a href="http://www.bwlc.net/" target="_blank">http://www.bwlc.net/</a></li>
                        <!--li>参考网址：<a href="http://www.1392c.com/gdkl10/kaijiang/" target="_blank">http://www.1392c.com/gdkl10/kaijiang/</a></li-->
                        <li>该游戏的投注时间、开奖时间和开奖号码与“北京快乐8”完全同步，开奖时间为北京时间（GMT+8）上午09:00至晚上24:00（5分钟一期），总共179期。</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、选号玩法</h5>
                    <ul>
                        <li>选号玩法是在1至80的80个号码中选出1至5个号码组合成一组进行的投注。会员将选择的投注号码与中奖号码对照，根据所选号码与中奖号码相符的个数多少（顺序不限）确定相应的中奖奖级。</li>
                    </ul>
                    <h5>2、和值玩法</h5>
                    <ul>
                        <li>以所有开出的全部20个号码加起来的和值来判定。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>单双：20个号码加总的和值为单，叫做和单；20个号码加总的和值为双，叫做和双。</li>
                                <li>大小：20个号码加总的和值大于810，为和大；20个号码加总的和值小于810，则为和小。</li>
                                <li>和值810：20个号码加总的和值等于810，叫和值810。</li>
                            </ul>
                        </li>
                    </ul>
                    <h5>3、上下盘玩法</h5>
                    <ul>
                        <li>以所有开出的全部20个号码占比来判定。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>上盘：开奖号码1至40为上盘号码。开出的20个号码中，上盘号码（1-40）在此局开出号码数目占多数时（超过10个），此局为上盘。</li>
                                <li>下盘：开奖号码41至80为下盘号码。开出的20个号码中，下盘号码（41-80）在此局开出号码数目占多数时（超过10个），此局为下盘。</li>
                                <li>中盘：开奖号码1至40（上盘号码）和41至80（下盘号码）在此局开出的数目相同时（各10个数字），此局为中盘。</li>
                            </ul>
                        </li>
                    </ul>
                    <h5>4、奇偶盘玩法</h5>
                    <ul>
                        <li>以所有开出的全部20个号码占比来判定。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>奇盘：开出的20个号码中，奇数号码在此局开出号码数目占多数时（超过10个），此局为奇盘。</li>
                                <li>偶盘：开出的20个号码中，偶数号码在此局开出号码数目占多数时（超过10个），此局为偶盘。</li>
                                <li>和盘：开出的20个号码中，奇数号码和偶数号码在此局开出的数目相同时（各10个数字），此局为和盘。</li>
                            </ul>
                        </li>
                    </ul>
                </div>
            </div>
