<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>开奖时间为每天8：55到23:25:00</li>
                        <li>开奖频率与次数：10分钟/期，共87期(其中一分11选5为每分钟一期共1440期,三分11选5为每三分钟一期共480期)</li>

                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、两面</h5>
                    <ul>
                        <li>单、双；大、小：单、双：号码为双数叫双，如8、2；号码为单数叫单，如1、5；开出11为和 大、小：开出之号码大于或等于6为大，小于或等于5为小；开出11为和。</li>
                        <li>总和单双：所有5个开奖号码的数字总和值是单数为总和单，如数字总和值是31、19；所有5个开奖号码的数字总和值是双数为总和双，如数字总和是42、20；假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖，数字总和29时为打和。</li>
                        <li>总和大小：所有5个开奖号码的数字总和值31到45为总大；所有5个开奖号码的数字总和值15到29为总和小；所有5个开奖号码的数字总和值为30打和；如开奖号码为01、02、08、09、11，数字总和是31，则总和大。假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖，打和不计算结果。</li>

                    </ul>
                    <h5>2、正码一</h5>
                    <ul>
                        <li>第一个开奖号码为正码一 例如开奖号码为02 03 05 07 08。特码玩法，下注02即为中奖，其他情况视为不中奖。</li>
                    </ul>
                    <h5>3、正码二</h5>
                    <ul>
                        <li>第二个开奖号码为正码二 例如开奖号码为02 03 05 07 08。特码玩法，下注02即为中奖，其他情况视为不中奖。</li>
                    </ul>
                    <h5>4、正码三</h5>
                    <ul>
                        <li>第三个开奖号码为正码三 例如开奖号码为02 03 05 07 08。特码玩法，下注02即为中奖，其他情况视为不中奖。</li>
                    </ul>
                    <h5>5、正码四</h5>
                    <ul>
                        <li>第四个开奖号码为正码四 例如开奖号码为02 03 05 07 08。特码玩法，下注02即为中奖，其他情况视为不中奖。</li>
                    </ul>
                    <h5>6、正码五</h5>
                    <ul>
                        <li>第五个开奖号码为正码五 例如开奖号码为02 03 05 07 08。特码玩法，下注02即为中奖，其他情况视为不中奖。</li>
                    </ul>
                    <h5>7、全五中一</h5>
                    <ul>
                        <li>投注的号码与开奖的五个号码中任意一个相同即为中奖，其他情况视为不中奖</li>
                    </ul>
                    <h5>8、龙虎斗</h5>
                    <ul>
                        <li>共有10个单独的投注台面，每一个投注台面的左边为龙，右边为虎。如在第一球vs第二球的投注台面，则第一球为龙，第二球为虎；计算公式为：第一球的结果为龙的点数，第二球的结果为虎的点数。若选择第一球vs第五球台面，则第一球为龙，第五球为虎，以此类推。</li>
                    </ul>
                </div>
            </div>
