<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>官方网站：<a href="http://www.lottery.gov.cn/" target="_blank">http://www.lottery.gov.cn/</a></li>
                        <li>该游戏的投注时间、开奖时间和开奖号码与“七星彩”完全同步，开奖时间为北京时间（GMT+8）每个星期的二、五、日晚上20:30。</li>
                        <li style="color:red">提示：依照开奖顺序分别为仟位、佰位、拾位、个位、分位、拾分、佰分。</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、定位</h5>
                    <ul>
                        <li>一定位：指仟位、佰位、拾位、个位任意一个位置与对应位置的开奖结果相同视为中奖，其余情形视为不中奖。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>仟位：指下注的号码与开奖号码相同，视为中奖，如仟位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>佰位：指下注的号码与开奖号码相同，视为中奖，如佰位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>拾位：指下注的号码与开奖号码相同，视为中奖，如拾位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>个位：指下注的号码与开奖号码相同，视为中奖，如个位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                            </ul>
                        </li>
                        <li>二定位：指仟位、佰位、拾位、个位其中两个位置与对应位置的开奖结果相同视为中奖，其余情形视为不中奖。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>仟位：指下注的号码与开奖号码相同，视为中奖，如仟位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>佰位：指下注的号码与开奖号码相同，视为中奖，如佰位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>拾位：指下注的号码与开奖号码相同，视为中奖，如拾位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>个位：指下注的号码与开奖号码相同，视为中奖，如个位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                            </ul>
                        </li>
                        <li>三定位：指仟位、佰位、拾位、个位其中三个位置与对应位置的开奖结果相同视为中奖，其余情形视为不中奖。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>仟位：指下注的号码与开奖号码相同，视为中奖，如仟位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>佰位：指下注的号码与开奖号码相同，视为中奖，如佰位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>拾位：指下注的号码与开奖号码相同，视为中奖，如拾位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>个位：指下注的号码与开奖号码相同，视为中奖，如个位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                            </ul>
                        </li>
                        <li>四定位：指仟位、佰位、拾位、个位其中四个位置与对应位置的开奖结果相同视为中奖，其余情形视为不中奖。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>仟位：指下注的号码与开奖号码相同，视为中奖，如仟位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>佰位：指下注的号码与开奖号码相同，视为中奖，如佰位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>拾位：指下注的号码与开奖号码相同，视为中奖，如拾位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                                <li>个位：指下注的号码与开奖号码相同，视为中奖，如个位开出号码 8，下注仟位为 8 者视为中奖，其余情形视为不中奖。</li>
                            </ul>
                        </li>
                    </ul>
                    <h5>2、字现</h5>
                    <ul>
                        <li>二字现：指仟位、佰位、拾位、个位任意两个位置的开奖结果与下注的号码相同（不需要相同顺序）视为中奖，其余情形视为不中奖。</li>
                        <li>三字现：指仟位、佰位、拾位、个位任意三个位置的开奖结果与下注的号码相同（不需要相同顺序）视为中奖，其余情形视为不中奖。</li>
                    </ul>
                </div>
            </div>
