<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>该游戏的投注时间、开奖时间和开奖号码与“云南快乐10分”完全同步，开奖时间为北京时间（GMT+8）上午08:40至晚上22:30（10分钟一期），总共84期。</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、第一球 ~ 第八球</h5>
                    <ul>
                        <li>第一球~第八球：指下注的每一球特码与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。</li>
                        <li>两面：指单、双；大、小；尾大、尾小；合单、合双。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>单双：号码为双数叫双，如8、16；号码为单数叫单，如19、5。</li>
                                <li>大小：开出之号码大于或等于11为大，小于或等于10为小。</li>
                                <li>尾数大小：开出之尾数大于或等于5为尾大，小于或等于4为尾小。</li>
                                <li>合数单双：开出之个位数与十位数之和为单、双的一种玩法。</li>
                            </ul>
                        </li>
                        <li>中发白：</li>
                        <li style="list-style:none">
                            <ul>
                                <li>中：开出之号码为01、02、03、04、05、06、07</li>
                                <li>发：开出之号码为08、09、10、11、12、13、14</li>
                                <li>白：开出之号码为15、16、17、18、19、20</li>
                            </ul>
                        </li>
                        <li>东南西北：</li>
                        <li style="list-style:none">
                            <ul>
                                <li>东：开出之号码为01、05、09、13、17</li>
                                <li>南：开出之号码为02、06、10、14、18</li>
                                <li>西：开出之号码为03、07、11、15、19</li>
                                <li>北：开出之号码为04、08、12、16、20</li>
                            </ul>
                        </li>
                        <li style="color:red">提示：每一个号码为一投注组合，假如投注号码为开奖号码并在所投的球位置，视为中奖，其余情形视为不中奖。</li>
                    </ul>
                    <h5>2、总和</h5>
                    <ul>
                        <li>总和单双：所有8个开奖号码的数字总和值是单数为总和单，如数字总和值是31、51；所有8个开奖号码的数字总和值是双数为总和双，如数字总和是42、80；假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖。</li>
                        <li>总和大小：所有8个开奖号码的数字总和值85到132为总大；所有8个开奖号码的数字总和值36到83为总分小；所有8个开奖号码的数字总和值为84打和；如开奖号码为01、20、02、08、17、09、11，数字总和是68，则总分小。假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖，打和不计算结果。</li>
                        <li>总尾大小：所有8个开奖号码的数字总和数值的个位数大于或等于5为总尾大，小于或等于4为总尾小；假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖。</li>
                    </ul>
                    <h5>3、龙虎斗</h5>
                    <ul>
                        <li>第一球 vs 第八球 龙虎：“第一球”球号大于“第八球”球号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>第二球 vs 第七球 龙虎：“第二球”球号大于“第七球”球号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>第三球 vs 第六球 龙虎：“第三球”球号大于“第六球”球号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                        <li>第四球 vs 第五球 龙虎：“第四球”球号大于“第五球”球号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
                    </ul>
                </div>
            </div>
