<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>官方网站：<a href="http://www.cqcp.net/" target="_blank">http://www.cqcp.net/</a></li>
                        <!--li>参考网址：<a href="http://www.1392c.com/shishicai/kaijiang/" target="_blank">http://www.1392c.com/shishicai/kaijiang/</a></li-->
                        <li>该游戏的投注时间、开奖时间和开奖号码与“新疆时时彩”完全同步，开奖时间为北京时间（GMT+8）每天白天从上午9：00开到晚上23：00，每 10 分钟开一次奖，每天开奖 84 期。</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、第一球 ~ 第五球</h5>
                    <ul>
                        <li>第一球~第五球：指下注的每一球特码与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。</li>
                        <li>单双大小：根据相应单项投注第一球 ~ 第五球开出的球号，判断胜负。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>大小：根据相应单项投注的第一球 ~ 第五球开出的球号大于或等于 5 为特码大，小于或等于 4 为特码小。</li>
                                <li>单双：根据相应单项投注的第一球 ~ 第五球开出的球号为双数则为特码双，如 2、6；球号为单数则为特码单，如 1、3。</li>
                            </ul>
                        </li>
                    </ul>
                    <h5>2、总和</h5>
                    <ul>
                        <li>大小：根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值大于或等于 23 为总和大，小于或等于 22 为总和小。</li>
                        <li>单双：根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值是双数为总和双，数字总和值是单数为总和单。</li>
                    </ul>
                    <h5>3、前三特殊玩法：豹子 &raquo; 顺子 &raquo; 对子 &raquo; 半顺 &raquo; 杂六</h5>
                    <ul>
                        <li>豹子：开奖号码的万位千位百位数字都相同。如中奖号码为：222XX、666XX、888XX…开奖号码的万位千位百位数字相同，则投注前三豹子者视为中奖，其它视为不中奖。</li>
                        <li>顺子：开奖号码的万位千位百位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：123XX、901XX、321XX、798XX…开奖号码的万位千位百位数字相连，则投注前三顺子者视为中奖，其它视为不中奖。</li>
                        <li>对子：开奖号码的万位千位百位任意两位数字相同（不包括豹子）。如中奖号码为：001XX，288XX、696XX…开奖号码的万位千位百位有两位数字相同，则投注前三对子者视为中奖，其它视为不中奖。如果开奖号码为前三豹子，则前三对子视为不中奖。</li>
                        <li>半顺：开奖号码的万位千位百位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：125XX、540XX、390XX、160XX…开奖号码的万位千位百位有两位数字相连，则投注前三半顺者视为中奖，其它视为不中奖。如果开奖号码为前三顺子、前三对子，则前三半顺视为不中奖。如开奖号码为：123XX、901XX、556XX、233XX…视为不中奖。</li>
                        <li>杂六：不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：157XX、268XX…开奖号码位数之间无关联性，则投注前三杂六者视为中奖，其它视为不中奖。</li>
                    </ul>
                    <h5>4、中三特殊玩法：豹子 &raquo; 顺子 &raquo; 对子 &raquo; 半顺 &raquo; 杂六</h5>
                    <ul>
                        <li>豹子：开奖号码的万位千位百位数字都相同。如中奖号码为：X222X、X666X、X888X…开奖号码的万位千位百位数字相同，则投注前三豹子者视为中奖，其它视为不中奖。</li>
                        <li>顺子：开奖号码的万位千位百位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：X123X、X901X、X321X、X798X…开奖号码的万位千位百位数字相连，则投注前三顺子者视为中奖，其它视为不中奖。</li>
                        <li>对子：开奖号码的万位千位百位任意两位数字相同（不包括豹子）。如中奖号码为：X001X，X288X、X696X…开奖号码的万位千位百位有两位数字相同，则投注前三对子者视为中奖，其它视为不中奖。如果开奖号码为前三豹子，则前三对子视为不中奖。</li>
                        <li>半顺：开奖号码的万位千位百位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：X125X、X540X、X390X、X160X…开奖号码的万位千位百位有两位数字相连，则投注前三半顺者视为中奖，其它视为不中奖。如果开奖号码为前三顺子、前三对子，则前三半顺视为不中奖。如开奖号码为：X123X、X901X、X556X、X233X…视为不中奖。</li>
                        <li>杂六：不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：X157X、X268X…开奖号码位数之间无关联性，则投注前三杂六者视为中奖，其它视为不中奖。</li>
                    </ul>
                    <h5>5、后三特殊玩法：豹子 &raquo; 顺子 &raquo; 对子 &raquo; 半顺 &raquo; 杂六</h5>
                    <ul>
                        <li>豹子：开奖号码的万位千位百位数字都相同。如中奖号码为：XX222、XX666、XX888…开奖号码的万位千位百位数字相同，则投注前三豹子者视为中奖，其它视为不中奖。</li>
                        <li>顺子：开奖号码的万位千位百位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：XX123、XX901、XX321、XX798…开奖号码的万位千位百位数字相连，则投注前三顺子者视为中奖，其它视为不中奖。</li>
                        <li>对子：开奖号码的万位千位百位任意两位数字相同（不包括豹子）。如中奖号码为：XX001，XX288、XX696…开奖号码的万位千位百位有两位数字相同，则投注前三对子者视为中奖，其它视为不中奖。如果开奖号码为前三豹子，则前三对子视为不中奖。</li>
                        <li>半顺：开奖号码的万位千位百位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：XX125、XX540、XX390、XX160…开奖号码的万位千位百位有两位数字相连，则投注前三半顺者视为中奖，其它视为不中奖。如果开奖号码为前三顺子、前三对子，则前三半顺视为不中奖。如开奖号码为：XX123、XX901、XX556、XX233…视为不中奖。</li>
                        <li>杂六：不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：XX157、XX268…开奖号码位数之间无关联性，则投注前三杂六者视为中奖，其它视为不中奖。</li>
                    </ul>
                    <h5>6、龙虎和特殊玩法：龙 &raquo; 虎 &raquo; 和（0为最小，9为最大）</h5>
                    <ul>
                        <li>龙：开奖第一球（万位）的号码 大于 第五球（个位）的号码。如：第一球开出 6，第五球开出 2、第一球开出 8，第五球开出 6、第一球开出 5，第五球开出 1…开奖为龙，投注龙者视为中奖，其它视为不中奖。</li>
                        <li>虎：开奖第一球（万位）的号码 小于 第五球（个位）的号码。如：第一球开出 2，第五球开出 6、第一球开出 6，第五球开出 8、第一球开出 1，第五球开出 5…开奖为虎，投注虎者视为中奖，其它视为不中奖。</li>
                        <li>和：开奖第一球（万位）的号码 等于 第五球（个位）的号码。如：2XXX2、6XXX6、8XXX8…开奖为和，投注和者视为中奖，其它视为不中奖。</li>
                    </ul>
                </div>
            </div>
