<?php !defined('IN_LOT')&&die('Access Denied'); ?>
            <div class="tab-colored-bd hide">
                <div class="typo">
                    <h3>游戏简介</h3>
                    <ul>
                        <li>官方网站：<a href="http://www.lottery.gov.cn/" target="_blank">http://www.lottery.gov.cn/</a></li>
                        <!--li>参考网址：<a href="http://www.1392c.com/shishicai/kaijiang/" target="_blank">http://www.1392c.com/shishicai/kaijiang/</a></li-->
                        <li>该游戏的投注时间、开奖时间和开奖号码与“福彩3D”完全同步，开奖时间为北京时间（GMT+8）每天晚上21:30。</li>
                        <li style="color:red">提示：依照开奖顺序分别为百位、十位、个位。</li>
                    </ul>
                    <h3>游戏玩法</h3>
                    <h5>1、百、十、个位</h5>
                    <ul>
                        <li>百、十、个位：指下注的每一球特码与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。</li>
                        <li>单双大小：根据相应单项投注百、十、个位开出的球号，判断胜负。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>大小：根据相应单项投注的百、十、个位开出的球号大于或等于 5 为特码大，小于或等于 4 为特码小。</li>
                                <li>单双：根据相应单项投注的百、十、个位开出的球号为双数则为特码双，如 2、6；球号为单数则为特码单，如 1、3。</li>
                            </ul>
                        </li>
                    </ul>
                    <h5>2、跨度</h5>
                    <ul>
                        <li>指下注的跨度与百、十、个位开出的球号最大差距（跨度）相同，视为中奖，如开出球号分别为 3、4、8，跨度为 5，下注跨度为 5 者视为中奖，其余情形视为不中奖。</li>
                    </ul>
                    <h5>3、和值</h5>
                    <ul>
                        <li>和值：指下注的号码与百、十、个位球号总和相同，视为中奖，如总和为 8，下注号码为 8 者视为中奖，其余情形视为不中奖。</li>
                        <li>单双大小：根据百、十、个位球号总和，判断胜负。</li>
                        <li style="list-style:none">
                            <ul>
                                <li>大小：根据相应单项投注的百、十、个位开出的球号总和大于或等于 15 为大，小于或等于 14 为小。</li>
                                <li>单双：根据相应单项投注的百、十、个位开出的球号总和为双数则为双，如 2、6；球号为单数则为单，如 1、3。</li>
                            </ul>
                        </li>
                        <li>区域：指下注的区域包含百、十、个位球号总和，视为中奖，如总和为 8，下注区域为 8、9、10、11 者视为中奖，其余情形视为不中奖。</li>
                    </ul>
                </div>
            </div>
